tutorials/plastic_cases/fracture_wellbore_pressure/0/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   uniform 6.7e-11;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    upperInlet
    {
        type            zeroGradient;
    }

    lowerInlet
    {
        type            zeroGradient;
    }

    rightInlet
    {
        type            zeroGradient;
    }

    leftInlet
    {
        type            zeroGradient;
    }
    walls2
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
